app/Validation/UtilisateurRules.php

SELECT *
FROM `adherent`
WHERE `login` = 'admin@gmail.com'
AND `motPasse` = 'admin'
 LIMIT 1
---
    public function utilisateurValide(string $str, string $fields, array $data): bool
    {
        $model = new AdherentModel();
        $user = $model
            ->where('login', $data['login'])
            ->where('motPasse', $data['motPasse'])
            ->first();