app/Controllers/Adherent.php

    public function adhererTontine($idTontine)
    {
        $data = [
            "titre" => "Sama Tontine::Accueil adherent",
            "menuActif" => "adherentAcc"
        ];
        if($this->request->getMethod()=="post")
        {
            $reglesValid = [
                "montant" => [
                    "rules" => "required|integer",
                    "errors" => [
                        "required" => "Le montant est obligatoire",
                        "integer" => "Le montant doit être un nombre"
                    ]
                ]
            ];
            if(!$this->validate($reglesValid))
            {
                $data["validation"] = $this->validator;
            }
            else
            {
                $participeData = [
                    "idTontine" => $this->request->getPost('idTontine'),
                    "montant" => $this->request->getPost('montant'),
                    "idAdherent" => session()->get('id')
                ];
                $participe = new ParticipeModel;
                $participe->insert($participeData);
---
INSERT INTO `participe` (`idTontine`, `montant`, `idAdherent`) VALUES ('7', '17000', '2')