app/Controllers/Administrateur.php

    public function index()
    {
        $data = [
            "titre" => "Sama tontine::Espace d'administration",
            "menuActif" => "adminAcc",
        ];
        $model = new TontineModel();
        $participeModel = new ParticipeModel();
        $nbTontine = $model->countAll();
        $nbParticipe = $participeModel->countAll();
---
SELECT COUNT(*) AS `numrows` FROM `tontine`
SELECT COUNT(*) AS `numrows` FROM `participe`