app/Controllers/Utilisateur.php

SELECT *
FROM `adherent`
WHERE `login` = 'admin@gmail.com'
AND `motPasse` = 'admin'
 LIMIT 1
---
            else
            {
                $model = new AdherentModel();
                $user = $model
                    ->where('login', $this->request->getPost('login'))
                    ->where('motPasse', $this->request->getPost('motPasse'))
                    ->first();

SELECT *
FROM `adherent`
---
    public function gestion()
    {
        $data = [
            "titre" => "Sama tontine::Gestion utilisateur",
            "menuActif" => "adminGestion",
        ];
        $modelAd = new AdherentModel();
        $listeUtilisateur = $modelAd->findAll();

SELECT *
FROM `adherent`
WHERE `adherent`.`id` = '8'
---
    public function modifierPasse()
    {
        $data = [
            "titre" => "Sama tontine::Réinitialiser son mot de passe",
            "menuActif" => "adherentAcc",
        ];
        $modelAd = new AdherentModel();
        $utilisateur = $modelAd->find(session()->get("id"));

SELECT *
FROM `adherent`
WHERE `adherent`.`id` = '8'
---
    public function profil()
    {
        $data = [
            "titre" => "Sama tontine::Profile: " . session()->get("prenom") . " " . session()->get("nom"),
            "menuActif" => "profil",
        ];
        $modelAd = new AdherentModel();
        $utilisateur = $modelAd->find(session()->get("id"));