app/Models/EcheanceModel.php

INSERT INTO `echeance` (`date`, `idTontine`, `numero`) VALUES ('2022-04-19','7',1), ('2022-05-19','7',2), ('2022-06-19','7',3), ('2022-07-19','7',4), ('2022-08-19','7',5), ('2022-09-19','7',6), ('2022-10-19','7',7)
---
    function generer($tabEcheance)
    {
        return $this->insertBatch($tabEcheance);

SELECT *
FROM `echeance`
WHERE `idTontine` = '8'
---
    function echeancesTontine($idTontine)
    {
        return $this
            ->where('idTontine', $idTontine)
            ->findAll();