app/Models/TontineModel.php

    function listeTontineResp($idAdherent)
    {
        return $this
            ->where('idResponsable', $idAdherent)
            ->findAll();
---
SELECT *
FROM `tontine`
WHERE `idResponsable` = '1'

    function tontine($idTontine)
    {
        return $this
            ->where('id', $idTontine)
            ->first();
---
SELECT *
FROM `tontine`
WHERE `id` = '8'
 LIMIT 1

    function listeTontines($idAdherent)
    {
        $listPart = $this
            ->builder('participe')
            ->distinct()
            ->select('idTontine')
            ->where('idAdherent', $idAdherent)
            ->get()->getResultArray();
---
SELECT DISTINCT `idTontine`
FROM `participe`
WHERE `idAdherent` = '8'

    function listeTontineAdherent($idAdherent)
    {
        return $this
            ->select('libelle, periodicite, dateDeb, nbEcheance')
            ->selectSum('p.montant', 'montant')
            ->join('participe p', 'p.idTontine=tontine.id')
            ->join('cotise c', 'c.idAdherent=p.idAdherent')
            ->join('echeance e', 'e.idTontine=tontine.id')
            ->groupBy("tontine.id")
            ->where('idResponsable', $idAdherent)
            ->where('c.idEcheance=e.id')
            ->get()->getResultArray();
---
SELECT `libelle`, `periodicite`, `dateDeb`, `nbEcheance`, SUM(`p`.`montant`) AS `montant`
FROM `tontine`
JOIN `participe` `p` ON `p`.`idTontine`=`tontine`.`id`
JOIN `cotise` `c` ON `c`.`idAdherent`=`p`.`idAdherent`
JOIN `echeance` `e` ON `e`.`idTontine`=`tontine`.`id`
WHERE `idResponsable` = '1'
AND `c`.`idEcheance` = `e`.`id`
GROUP BY `tontine`.`id`

    function listeParticipantTontine()
    {
        return $this
            ->select('count(p.idTontine) nbp, libelle')
            ->join('participe p', 'p.idTontine=id')
            ->groupBy('p.idTontine')
            ->get()->getResultArray();
---
SELECT count(p.idTontine) nbp, `libelle`
FROM `tontine`
JOIN `participe` `p` ON `p`.`idTontine`=`id`
GROUP BY `p`.`idTontine`